// See https://aka.ms/new-console-template for more information
// Задача 2. Программа на вход принимает два числаи выдает, какое число больше, а какое меньше
Console.WriteLine("Hello, World!");

